# RepeaterCoordinates Methods

---
The RepeaterCoordinates type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetCoordinate|  Returns the coordinate in the given dimension.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace